// 88. Заменить все вхождения подстроки w в строке st на строку v. 
// Вывести на экран первоначальную строку и конечную строку

string st="Hello! How was your day?";
System.Console.WriteLine($"{st}");

string w="was your";
string v="is their";
for (int i=0; i<st.Length; i++)
   