// 80. Вывести на экран кодировку ASCII(с 32 по 122)

for (int i=32; i<=122; i++)
    System.Console.Write((char)i);